
condition = {
    "back_date": "2025-04-25",
    "depart_date": "",
    "max_price": "4000",
    "min_price": "",
    "stock": ""
}
  
products = [
{
  "cals": [
    {
      "back_date": "2025-04-14",
      "depart_date": "2025-04-09",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-04-16",
      "depart_date": "2025-04-11",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-04-21",
      "depart_date": "2025-04-16",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-04-23",
      "depart_date": "2025-04-18",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-04-28",
      "depart_date": "2025-04-23",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-04-30",
      "depart_date": "2025-04-25",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-05-05",
      "depart_date": "2025-04-30",
      "price": "7999.0",
      "stock": "4"
    },
    {
      "back_date": "2025-05-12",
      "depart_date": "2025-05-07",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-05-14",
      "depart_date": "2025-05-09",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-05-19",
      "depart_date": "2025-05-14",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-05-21",
      "depart_date": "2025-05-16",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-05-26",
      "depart_date": "2025-05-21",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-05-28",
      "depart_date": "2025-05-23",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-02",
      "depart_date": "2025-05-28",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-04",
      "depart_date": "2025-05-30",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-09",
      "depart_date": "2025-06-04",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-11",
      "depart_date": "2025-06-06",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-16",
      "depart_date": "2025-06-11",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-18",
      "depart_date": "2025-06-13",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-23",
      "depart_date": "2025-06-18",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-25",
      "depart_date": "2025-06-20",
      "price": "6399.0",
      "stock": "6"
    },
    {
      "back_date": "2025-06-30",
      "depart_date": "2025-06-25",
      "price": "6399.0",
      "stock": "6"
    }
  ],
  "product_feature": "productNum：U182795\n成人售价：：6399.0\n出发日期：2025-04-09\n返回日期：2025-04-14\n存量：6\n成人售价：：6399.0\n出发日期：2025-04-11\n返回日期：2025-04-16\n存量：6\n成人售价：：6399.0\n出发日期：2025-04-16\n返回日期：2025-04-21\n存量：6\n成人售价：：6399.0\n出发日期：2025-04-18\n返回日期：2025-04-23\n存量：6\n成人售价：：6399.0\n出发日期：2025-04-23\n返回日期：2025-04-28\n存量：6\n成人售价：：6399.0\n出发日期：2025-04-25\n返回日期：2025-04-30\n存量：6\n成人售价：：7999.0\n出发日期：2025-04-30\n返回日期：2025-05-05\n存量：4\n成人售价：：6399.0\n出发日期：2025-05-07\n返回日期：2025-05-12\n存量：6\n成人售价：：6399.0\n出发日期：2025-05-09\n返回日期：2025-05-14\n存量：6\n成人售价：：6399.0\n出发日期：2025-05-14\n返回日期：2025-05-19\n存量：6\n成人售价：：6399.0\n出发日期：2025-05-16\n返回日期：2025-05-21\n存量：6\n成人售价：：6399.0\n出发日期：2025-05-21\n返回日期：2025-05-26\n存量：6\n成人售价：：6399.0\n出发日期：2025-05-23\n返回日期：2025-05-28\n存量：6\n成人售价：：6399.0\n出发日期：2025-05-28\n返回日期：2025-06-02\n存量：6\n成人售价：：6399.0\n出发日期：2025-05-30\n返回日期：2025-06-04\n存量：6\n成人售价：：6399.0\n出发日期：2025-06-04\n返回日期：2025-06-09\n存量：6\n成人售价：：6399.0\n出发日期：2025-06-06\n返回日期：2025-06-11\n存量：6\n成人售价：：6399.0\n出发日期：2025-06-11\n返回日期：2025-06-16\n存量：6\n成人售价：：6399.0\n出发日期：2025-06-13\n返回日期：2025-06-18\n存量：6\n成人售价：：6399.0\n出发日期：2025-06-18\n返回日期：2025-06-23\n存量：6\n成人售价：：6399.0\n出发日期：2025-06-20\n返回日期：2025-06-25\n存量：6\n成人售价：：6399.0\n出发日期：2025-06-25\n返回日期：2025-06-30\n存量：6",
  "product_num": "U182795"
},
{
  "cals": [
    {
      "back_date": "2025-04-10",
      "depart_date": "2025-04-04",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-04-17",
      "depart_date": "2025-04-11",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-04-24",
      "depart_date": "2025-04-18",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-05-01",
      "depart_date": "2025-04-25",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-05-08",
      "depart_date": "2025-05-02",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-05-15",
      "depart_date": "2025-05-09",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-05-22",
      "depart_date": "2025-05-16",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-05-29",
      "depart_date": "2025-05-23",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-06-05",
      "depart_date": "2025-05-30",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-06-12",
      "depart_date": "2025-06-06",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-06-19",
      "depart_date": "2025-06-13",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-06-26",
      "depart_date": "2025-06-20",
      "price": "6599.0",
      "stock": "2"
    },
    {
      "back_date": "2025-07-03",
      "depart_date": "2025-06-27",
      "price": "6599.0",
      "stock": "2"
    }
  ],
  "product_feature": "productNum：U176847\n成人售价：：6599.0\n出发日期：2025-04-04\n返回日期：2025-04-10\n存量：2\n成人售价：：6599.0\n出发日期：2025-04-11\n返回日期：2025-04-17\n存量：2\n成人售价：：6599.0\n出发日期：2025-04-18\n返回日期：2025-04-24\n存量：2\n成人售价：：6599.0\n出发日期：2025-04-25\n返回日期：2025-05-01\n存量：2\n成人售价：：6599.0\n出发日期：2025-05-02\n返回日期：2025-05-08\n存量：2\n成人售价：：6599.0\n出发日期：2025-05-09\n返回日期：2025-05-15\n存量：2\n成人售价：：6599.0\n出发日期：2025-05-16\n返回日期：2025-05-22\n存量：2\n成人售价：：6599.0\n出发日期：2025-05-23\n返回日期：2025-05-29\n存量：2\n成人售价：：6599.0\n出发日期：2025-05-30\n返回日期：2025-06-05\n存量：2\n成人售价：：6599.0\n出发日期：2025-06-06\n返回日期：2025-06-12\n存量：2\n成人售价：：6599.0\n出发日期：2025-06-13\n返回日期：2025-06-19\n存量：2\n成人售价：：6599.0\n出发日期：2025-06-20\n返回日期：2025-06-26\n存量：2\n成人售价：：6599.0\n出发日期：2025-06-27\n返回日期：2025-07-03\n存量：2",
  "product_num": "U176847"
},
{
  "cals": [],
  "product_feature": "productNum：U174845",
  "product_num": "U174845"
},
{
  "cals": [
    {
      "back_date": "2025-05-04",
      "depart_date": "2025-04-29",
      "price": "9980.0",
      "stock": "10"
    }
  ],
  "product_feature": "productNum：U181428\n成人售价：：9980.0\n出发日期：2025-04-29\n返回日期：2025-05-04\n存量：10",
  "product_num": "U181428"
},
{
  "cals": [
    {
      "back_date": "2025-04-25",
      "depart_date": "2025-04-20",
      "price": "3199.0",
      "stock": "16"
    }
  ],
  "product_feature": "productNum：U184243\n成人售价：：3199.0\n出发日期：2025-04-20\n返回日期：2025-04-25\n存量：16",
  "product_num": "U184243"
}
]
